// Date - це об'єкт, який містить в собі дату і час. Дозволяє отримувати, зберігати та маніпулювати датою і часом.

// GMT - Greenwich Mean Time - часовий пояс, відлік від Гринвіча
// UTC - Universal Time Coordinated - всесвітньо координований час
// =========================================================================================================
// Створення об'єкту Date => new Date(arg)
// arg - аргумент, який може приймати різні значення:
// 1. Без аргумента - створюється об'єкт з поточною датою і часом
const date = new Date()
console.log(date) // виведеться дата на момент виконання коду. Даний час виведений у форматі ISO 8601
// в цьому об'єкті є дані за GMT (час по Гринвічу) і за UTC (локальний час). І в залежності що ми хочемо з тим часовим поясом ми і працюємо.
// 2. Число - створюється об'єкт з датою, яка відповідає кількості мілісекунд, які пройшли з 1 січня 1970 року
// 3. Рядок - створюється об'єкт з датою, яка відповідає рядку
// 4. Число, рядок - створюється об'єкт з датою, яка відповідає рядку, і часом, який відповідає числу
// 5. Число, число - створюється об'єкт з датою, яка відповідає першому числу, і часом, який відповідає другому числу
// 6. Число, число, число - створюється об'єкт з датою, яка відповідає першому числу, місяцю, який відповідає другому числу, і року, який відповідає третьому числу
// 7. Число, число, число, число - створюється об'єкт з датою, яка відповідає першому числу, місяцю, який відповідає другому числу, року, який відповідає третьому числу, і часу, який відповідає четвертому числу
// 8. Число, число, число, число, число - створюється об'єкт з датою, яка відповідає першому числу, місяцю, який відповідає другому числу, року, який відповідає третьому числу, часу, який відповідає четвертому числу, і мілісекундам, які відповідають п'ятому числу

// Методи Date:
// Всі методи Date повертають значення від 0 до 59, крім метода getDay, який повертає значення від 0 до 6, де 0 - неділя, 1 - понеділок і т.д.
// - toISOString() - повертає дату і час в форматі ISO 8601
const dateString = date.toISOString()
console.log(dateString)
console.log(new Date(dateString))
// - parse() - повертає кількість мілісекунд, які пройшли з 1 січня 1970 року до дати, яка вказана в рядку
console.log(Date.parse(dateString)) // 1688035097007
// - toString() - повертає дату і час в рядковому форматі
console.log(date.toString()) // Thu Jun 29 2023 13:38:17 GMT+0300 (за східноєвропейським літнім часом)
// - toUTCString() - повертає дату і час в рядковому форматі за UTC
console.log(date.toUTCString()) // Thu, 29 Jun 2023 10:39:24 GMT - це якщо нам треба працювати за 0 часовим поясом
// - toDateString() - повертає дату в рядковому форматі
console.log(date.toDateString()) // Thu Jun 29 2023
// - toTimeString() - повертає час в рядковому форматі
console.log(date.toTimeString()) // 13:41:58 GMT+0300 (за східноєвропейським літнім часом)
// - getTimezoneOffset() - повертає різницю між часовим поясом за UTC і часовим поясом за локальним часом в хвилинах
console.log(date.getTimezoneOffset()) // -180 - це означає, що ми в 3 години відстаємо від UTC (відображено в хвилинах)
let zone = date.getTimezoneOffset() / -60
console.log(zone) // 3 - те саме що і вище, але вже в годинах
