// Math - це вбудований об'єкт який містить в собі різні математичні функції та виконує різні математичні операції
let resultMath
// ---------------------------------------------------------------------------------------------
resultMath = Math.min(2, 6, 10, 1000) // 2 - мінімальне число
const minArr = [2, 6, 10, 1000]
resultMath = Math.min(...minArr) // 2 - мінімальне число. Тобто розпилює масив на окремі числа і вибирає мінімальне
// ---------------------------------------------------------------------------------------------
resultMath = Math.max(2, 5, 1, 200) // 200 - максимальне число
const maxArr = [2, 5, 1, 200]
resultMath = Math.max(...maxArr) // 200 - максимальне число
// ---------------------------------------------------------------------------------------------
resultMath = Math.PI // 3.14... - число пі
// ---------------------------------------------------------------------------------------------
resultMath = Math.sign(-10) // -1 - перевіряє чи число від'ємне, додатне чи нуль
resultMath = Math.sign(10) // 1
// ---------------------------------------------------------------------------------------------
resultMath = Math.round(3.5) // 4; 3.3 -> 3 - округлює до найближчого цілого числа
resultMath = Math.ceil(3.3) // 4; - округлює до більшого числа
resultMath = Math.floor(3.7) // 3; - округлює до меншого числа
resultMath = Math.trunk(3.7) // 3; - відкидає дробову частину і повертає ціле число
resultMath = Math.fround(3.7) // 3.700000047683716; - повертає число з плаваючою точкою, але з формату 8 байт (32 біти або double) до 4 байт (16 біт або float)
// а тепер подивимося на наступне
resultMath = 0.1 + 0.2 === 0.3 // false - це через те що використовується 8 байт
resultMath = (0.1 * 10 + 0.2 * 10) / 10 === 0.3 // true - це через те що використовується 4 байт
// або так
resultMath = Math.fround(0.1 + 0.2) === Math.fround(0.3) // true
// такі true та false виникають тільки при порівнянні чисел з типом даних double та float
// false - це через те що порівнюються 8 байт та 4 байти
// true - це через те що порівнюються 4 байт та 4 байти, тобто після використання Math.fround() обидва числа стають 4 байт
// це також працює з Math.round()
let resultMath2
resultMath2 = Math.round(0.1 + 0.2) === Math.round(0.3) // true
console.log(resultMath2)
resultMath2 = 0.1 + 0.2 === 0.3 // false
console.log(resultMath2)
// ---------------------------------------------------------------------------------------------
resultMath = Math.random() // 0.123456789 - випадкове число від 0 до 1 з дробовою частиною
resultMath = Math.random() * 100 // випадкове число від 0 до 100 з дробовою частиною
resultMath = Math.floor(Math.random() * 100) + 1 // випадкове число від 1 до 100 без дробової частини
// ---------------------------------------------------------------------------------------------
resultMath = Math.sqrt(9) // 3 - корінь квадратний
resultMath = Math.pow(2, 3) // (2*2*2) -> 8 - піднесення до степеня (2 в степені 3)
// ---------------------------------------------------------------------------------------------
resultMath = Math.abs(-7) // 7 - модуль числа

// random number without point between 0 and 100
